{
    "name": "VANT BOT",
    "description": "Bot oficial de Vanetti en estado de prueba.",
    "logo": "https://i.imgur.com/aPPapMg.png",
    "env": {
        "SECRET_DISCORD_TOKEN": {
            "description": "La ficha de tu bot de Discord",
            "required": true
        },
        "CONFIG_PREFIX": {
            "description": "El prefijo de tu bot",
            "required": true
        },
        "CONFIG_EMBED_COLOR": {
            "description": "El color del mensaje de inserción de su bot (código hexadecimal sin hashtag)"
        },
        "CONFIG_OWNERS": {
            "description": "Una ID de Discord, use coma si desea agregar más de 1 propietario (NO AGREGUE LA ID DE OTRA PERSONA EN LA QUE NO CONFIAR)",
            "required": false
        },
        "CONFIG_YOUTUBE_DATA_STRATEGY": {
            "description": "Estrategia para obtener información de video de youtube (scrape o api, predeterminado: scrape)",
            "required": false
        },
        "SECRET_YT_API_KEY": {
            "description": "Su clave de la API de YouTube v3 para recuperar información de video de YouTube si CONFIG_YOUTUBE_DATA_STRATEGY está configurado en api"
        },
        "CONFIG_TOTALSHARDS": {
            "description": "Total de fragmentos para generar, use \"auto\" o un número (predeterminado: automático)",
            "required": false
        },
        "CONFIG_DEFAULT_VOLUME": {
            "description": "Volumen predeterminado de la música (predeterminado: 50)",
            "required": false
        },
        "CONFIG_MAX_VOLUME": {
            "description": "Volumen máximo permitido para la música (predeterminado: 100)",
            "required": false
        },
        "CONFIG_DISABLE_SONG_SELECTION": {
            "description": "Ya sea para deshabilitar la selección de música en el comando de reproducción, esto seleccionará automáticamente el primer orden de los resultados de búsqueda (predeterminado: no)",
            "required": false
        },
        "CONFIG_SEARCH_MAX_RESULTS": {
            "description": "Máximo de música para listar en la selección de canciones (predeterminado: 10, máximo: 10)",
            "required": false
        },
        "CONFIG_SELECT_TIMEOUT": {
            "description": "Tiempo de espera de selección de música durante la búsqueda (predeterminado: 20 <20 segundos>)",
            "required": false
        },
        "CONFIG_ALLOW_DUPLICATE": {
            "description": "Ya sea para permitir que los usuarios agreguen un duplicado de música (sí o no, predeterminado: no)",
            "required": false
        },
        "CONFIG_DELETE_QUEUE_TIMEOUT": {
            "description": "Tiempo de espera en segundos antes de que se elimine la cola cuando no hay nadie en el canal de voz (predeterminado: 180 <3 minutos>)",
            "required": false
        },
        "CONFIG_CACHE_YOUTUBE_DOWNLOADS": {
            "description": "Ya sea para descargar y almacenar en caché la música de YouTube (sí o no, predeterminado: no)",
            "required": false
        },
        "CONFIG_CACHE_MAX_LENGTH": {
            "description": "Duración máxima de la música en segundos que se permite almacenar en caché (predeterminado: 5400 <1 hora y 30 minutos>)",
            "required": false
        },
        "CONFIG_DISABLE_INVITE_CMD": {
            "description": "Ya sea para deshabilitar el comando de invitación o no (predeterminado: no)",
            "required": false
        },
        "CONFIG_DEBUG": {
            "description": "¿Debería utilizar el registro el nivel de depuración? Tenga en cuenta que esto no se recomienda en producción (predeterminado: no)",
            "required": false
        },
        "CONFIG_FETCH_ALL_USERS": {
            "description": "Ya sea para buscar a todos los usuarios al inicio (predeterminado: no) (advertencia: mayor uso de memoria, especialmente para bots con grandes usuarios). NOTA: Debe habilitar Intents GUILD_MEMBERS privilegiados en la página del desarrollador)",
            "required": false
        },
        "CONFIG_STATUS_TYPE": {
            "description": "¿Qué tipo de estado usa el bot? (reproducir, escuchar o mirar, predeterminado: escuchar)",
            "required": false
        },
        "CONFIG_STATUS_ACTIVITY": {
            "description": "¿Qué estado muestra el bot? (predeterminado: \"música en {guildsCount} servidores\") (variables disponibles: guildsCount, usersCount, playingCount y botPrefix). NOTA SOBRE {usersCount} VARIABLE: Esto solo muestra el usersCount en caché, para obtener el usersCount completo, habilite CONFIG_FETCH_ALL_USERS",
            "required": false
        }
    }
    "repository": "https://github.com/iTzKrav/vant-bot"
}